kafka_benchmark_results_20251002_003914/low-latency/producer-test.log
5000 records sent, 1000.0 records/sec (0.98 MB/sec), 7.2 ms avg latency, 304.0 ms max latency.
5003 records sent, 1000.4 records/sec (0.98 MB/sec), 1.1 ms avg latency, 4.0 ms max latency.
12000 records sent, 999.500250 records/sec (0.98 MB/sec), 3.69 ms avg latency, 304.00 ms max latency, 1 ms 50th, 3 ms 95th, 85 ms 99th, 110 ms 99.9th.